
'''
Лабораторная работа введение в функции

Задание 1. Формальное приветствие
На занятии мы написали функцию greet():
def greet(): 
    name = input() 
    print("Hello,␣", name)
Исправьте эту функцию так, чтобы она спрашивала у пользователя не только имя, а имя и фамилию (каждое на отдельной строке), а затем выводила официальное приветствие в форме “Здравствуйте, {имя} {фамилия}.”.
В решении вы должны только написать эту функцию, но не запускать её. Чтобы тестирующая система могла проверить её, функция должна быть названа в точности greet и не должна иметь аргументов.
Формат ввода
greet()
C клавиатуры вводится:
Иван
Смирнов
Формат вывода
Здравствуйте, Иван Смирнов.
'''

def greet() -> None:
    name = input()
    second_name = input()
    print("Здравствуйте,", name, second_name)



'''
Задание 2. Привет, как тебя там?
Напишите функцию who_are_you_and_hello(), которая читает имя пользователя из стандартного ввода, пока он не введет его в правильном формате, а затем здоровается. Приветствие должно быть в форме: “Привет, {имя}!”. После вывода надо не забыть перевести курсор на новую строку.
Если пользователь ввёл имя в неправильной форме, функция должна считать его снова. Корректным считается имя, состоящее из одного слова, в котором нет символов кроме букв, первая буква заглавная, остальные — строчные.
После вывода приветствия функция должна завершить свою работу.
Обратите внимание: в вашей программе должна быть функция who_are_you_and_hello, но она не должна вызываться. Следите за тем, чтобы имя функции было написано верно.
Формат ввода
who_are_you_and_hello()
C клавиатуры вводится:
Зачем тебе это знать?
Хорошо, записывай
Василий Пупкин
Василий 1
Вася1
Вася!
ВАСЯ
Вася
И тебе привет
Михаил?
Михаил
Формат вывода
Привет, Вася!
'''

def who_are_you_and_hello() -> None:
    ALPHABET = 'АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя'
    while True:
        name = input('\n')

        if name != name.title():
            continue

        for i in name:
            if i not in ALPHABET:
                break
        else:
            print('Привет,', name)
            break
            


'''
Задание 3. Какая четверть?
Представьте себе координатную плоскость, образованную осями OX и OY. 
Оси делят плоскость на 4 равных части, которые для удобства пронумеровали следующим образом: 
четверть справа вверху обозначается I, и далее против часовой стрелки соответственно II, III и IV.
Напишите функцию quarter(xcoord, ycoord), которая принимает в качестве параметра координаты точки 
на плоскости и печатает, в какой четверти она лежит (см. пример)
Пример 1
Ввод	Вывод
quarter(3, 4)	I четверть
Пример 2
Ввод	Вывод
quarter(-3.5, 8)	II четверть
'''

def quarter(xcoord, ycoord):
    if xcoord > 0 and ycoord > 0:
        print('I четверть')
    elif xcoord < 0 and ycoord > 0:
        print('II четверть')
    elif xcoord < 0 and ycoord < 0:
        print('III четверть')
    elif xcoord > 0 and ycoord < 0:
        print('IV четверть')



'''
Задание 4. Золотое сечение
Вам необходимо написать функцию golden_ratio(i), которая получает число i как аргумент и печатает i-ое 
последовательное приближение золотого сечения.
i-ое приближения золотого сечения вычисляется как отношение (i+1)-го числа Фибоначчи к i-му.
Числами Фибоначчи называется последовательность, первые два элемента которой (нумерация с единицы) равны 1, 
а каждое из последующих чисел равно сумме двух предыдущих. Первые члены последовательности Фибоначчи таковы:
 
Таким образом первое приближение золотого сечения — 1/1, второе — 2/1, третье — 3/2, четвертое — 5/3 и т. д.
Следите за правильностью названия функции.
Пример 1
Ввод	Вывод
golden_ratio(1)	1.0
Пример 2
Ввод	Вывод
golden_ratio(2)	2.0
Пример 3
Ввод	Вывод
golden_ratio(4)	1.6666666666666667
'''

def golden_ratio(i: int) -> None:
    a, b = 1, 1

    for _ in range(i-1):
        a, b = b, a+b

    print(b/a)



'''
Задание 5. Скажи «пароль» и проходи

Напишите функцию ask_password(), которая запрашивает у пользователя пароль и сверяет его со строкой, в которой записано слово “password”. 
Пользователю дается три попытки. Как только пароль совпал с правильным значением, функция должна выводить 
«Пароль принят» и игнорировать дальнейший ввод. Если с трех попыток пользователь не смог угадать пароль, функция должна вывести на экран 
«В доступе отказано» и игнорировать ввод новых паролей.
Обратите внимание: в вашей программе должна быть функция ask_password, но она не должна вызываться. 
Следите за тем, чтобы имя функции было написано верно.
Тестирующая программа выглядит следующим образом:
ask_password()
Пример 1
Ввод	Вывод
qwerty
1234
йцукен
	В доступе отказано
Пример 2
Ввод	Вывод
qwerty
1234
password
Пароль принят
'''

def ask_password() -> None:
    valid_pass = 'password'

    for _ in range(3):
        user_pass = input('\nВведите пароль:\n')

        if user_pass == valid_pass:
            print('Пароль принят')
            return None
    else:
        print('В доступе отказано')



'''
Задание 6. Мелочь оставь себе

Напишите функцию take_large_banknotes(banknotes), которая будет принимать набор купюр и монет (в форме списка чисел, представляющих их номиналы), 
и возвращать список, в котором оставлены только крупные купюры больше (строго больше) 10 рублей.
Порядок отобранных купюр сохраните таким, какой был в исходном списке.
Вы только перечисляете купюры, которые хотите забрать, но не удаляете их из списка. Исходный список должен остаться неизменным.
Пример 1
Ввод	Вывод
print(*take_large_banknotes([]))	
Пример 2
Ввод	Вывод
print(*take_large_banknotes([1, 5, 500, 0.5, 2, 0.1, 10, 100, 100, 1000, 50]))	500 100 100
'''

def take_large_banknotes(banknotes: list) -> list:
    return list(filter(lambda i: i > 10, banknotes))



'''
Задание 7. Месяц/Month
Напишите функцию, которая принимает номер месяца и язык (русский или английский), а возвращает его название.
Пример 1
Ввод	Вывод
print(month_name(3, "en"))	March
Пример 2
Ввод	Вывод
print(month_name(3, "ru"))	март
'''

def which_month(month: int, lang: str) -> None:
    months_ru = {
        1: "Январь",
        2: "Февраль",
        3: "Март",
        4: "Апрель",
        5: "Май",
        6: "Июнь",
        7: "Июль",
        8: "Август",
        9: "Сентябрь",
        10: "Октябрь",
        11: "Ноябрь",
        12: "Декабрь"
    }
    months_en = {
        1: "January",
        2: "February",
        3: "March",
        4: "April",
        5: "May",
        6: "June",
        7: "July",
        8: "August",
        9: "September",
        10: "October",
        11: "November",
        12: "December"
    }

    if lang == 'ru':
        print(months_ru[month])
    else:
        print(months_en[month])
