
'''
Лабораторная работа: Функции с переменным числом аргументов
Задание 1.
 
Матрица
Напишите функцию, которая создает, заполняет и возвращает матрицу заданного размера. При этом (в зависимости от переданных аргументов) 
она должна вести себя так:
•	matrix() — создает матрицу 1×11×1, в которой единственное число равно нулю.
•	matrix(n) — создает матрицу n×nn×n, заполненную нулями.
•	matrix(n, m) — создает матрицу из nn строк и mm столбцов, заполненную нулями.
•	matrix(n, m, a) — создает матрицу из nn строк и mm столбцов, в которой каждый элемент равен aa.
При создании функции пользуйтесь аргументами по умолчанию.
Пример 1
Ввод	Вывод
rows = matrix()
for row in rows:
    print(*row)	0
Пример 2
Ввод	Вывод
rows = matrix(2)
for row in rows:
    print(*row)	0 0
0 0
'''

def matrix(n: int = 1, m: int = 1, a: str = '0') -> list[list]:
    return [[a]*m for _ in range(n)]



'''
Задание 2.

Бариста

На заводе «Кофейный» открывается новое кафе. Изначально есть некоторое количество кофейных зерен, молока и взбитых сливок.
Надо написать функцию choose_coffee(preference1, preference2,..., preferenceN), которая возвращает напиток, 
который можно приготовить из имеющихся продуктов (ingredients). На вход функция принимает заранее неизвестное количество предпочтений посетителя. 
Все напитки перечислены в порядке убывания предпочтений и гарантированно не повторяются. Бариста готовит наиболее предпочитаемый напиток из доступных.
Для Эспрессо требуется: 1 порция кофейных зерен.
Для Капучино требуется: 1 порция кофейных зерен и 3 порции молока.
Для Маккиато требуется: 2 порции кофейных зерен и 1 порция молока.
Для Кофе по-венски требуется: 1 порция кофейных зерен и 2 порции взбитых сливок.
Для Латте Маккиато требуется: 1 порция кофейных зерен, 2 порции молока и 1 порция взбитых сливок.
Для Кон Панна требуется: 1 порция кофейных зерен и 1 порция взбитых сливок.
При приготовлении напитка ингредиенты расходуются.
Если недостаточно ингредиентов, то вернуть сообщение: «К сожалению, не можем предложить Вам напиток».
Пример 1
Ввод	Вывод
ingredients = [1, 2, 3]
print(choose_coffee("Эспрессо", "Капучино", "Маккиато", "Кофе по-венски", "Латте Маккиато", "Кон Панна"))
print(choose_coffee("Эспрессо", "Капучино", "Маккиато", "Кофе по-венски", "Латте Маккиато", "Кон Панна"))	Эспрессо
К сожалению, не можем предложить Вам напиток
Пример 2
Ввод	Вывод
ingredients = [4, 4, 0]
print(choose_coffee("Капучино", "Маккиато", "Эспрессо"))
print(choose_coffee("Капучино", "Маккиато", "Эспрессо"))
print(choose_coffee("Капучино", "Маккиато", "Эспрессо"))	Капучино
Маккиато
Эспрессо
Примечания
ingredients – список длины три, в котором хранится количество порций кофейных зерен, молока и сливок соответственно.
'''

def choose_coffee(*preference: str):
    global ingredients
    COFFEE_RECIPES = {
        "Эспрессо": [1, 0, 0],
        "Капучино": [1, 3, 0],
        "Маккиато": [2, 1, 0],
        "Кофе по-венски": [1, 0, 2],
        "Латте Маккиато": [1, 2, 1],
        "Кон Панна": [1, 0, 1]
    }

    for coffee in preference:
        print(ingredients)
        for i in range(3):
            if ingredients[i] - COFFEE_RECIPES[coffee][i] < 0:
                return 'К сожалению, не можем предложить Вам напиток'
            ingredients[i] -= COFFEE_RECIPES[coffee][i]
        return coffee


ingredients = [4, 4, 0]
print(choose_coffee("Капучино", "Маккиато", "Эспрессо"))
print(choose_coffee("Капучино", "Маккиато", "Эспрессо"))
print(choose_coffee("Капучино", "Маккиато", "Эспрессо"))
