
'''
Лабораторная работа: Области видимости переменных

Задание 1. Длина окружности и площадь круга
Напишите две функции circle_length(radius) и circle_area(radius), принимающие радиус окружности и возвращающие длину этой окружности и 
площадь круга соответственно.
Также напишите функцию main(), которая спрашивает у пользователя радиус окружности, 
а затем при помощи функций circle_length(radius) и circle_area(radius) выводит на экран длину и площадь круга, разделённые пробелом.
Учтите, что радиус окружности – это вещественное число.
Число ππ взять равным 3.14159.
Пример 1
Ввод	Вывод
print(circle_length(5))	31.4159
Пример 2
Ввод	Вывод
print(circle_area(10))	314.159
Пример 3
Ввод	Вывод
main()
0.5	3.14159 0.7853975
'''

def circle_length(radius):
    pass

def circle_area(radius):
    pass




'''
Задание 2. Корни квадратного уравнения

Напишите две функции larger_root(p,q) и smaller_root(p,q), которые возвращают больший и меньший корни приведённого квадратного уравнения x2 + px + q = 0. В качестве аргументов функции должны принимать коэффициенты p и q. Считать, что дискриминант неотрицателен.
Также сделайте функцию discriminant(a,b,c), которая вычисляет и возвращает дискриминант квадратного уравнения, записанного в общем виде: ax2 + bx + c = 0.
Функции вычисления корней должны использовать функцию вычисления дискриминанта.
Наконец, сделайте функцию main(), которая запрашивает у пользователя два вещественных числа p и q, и в ответ печатает на первой строке дискриминант уравнения x2 + px + q = 0, на второй строке – меньший и больший корни. Она должна выводить оба корня, даже если они совпадают.
Формат ввода
Ввод функции main()
-2.5
1
Формат вывода
Вывод функции main():
2.25
0.5 2.0
Пример 1
Ввод	Вывод
print(smaller_root(2, 1))	-1.0
Пример 2
Ввод	Вывод
print(larger_root(2, 1))	-1
Пример 3
Ввод	Вывод
print(discriminant(1, 2, 1))	0



Задание 3. Длинный чек

Для работы небольшого магазинчика вас попросили сделать небольшой набор функций, обеспечивающих работу с чеками. В качестве пробной версии вам нужно реализовать всего два действия: добавление покупки к набору покупаемых товаров, и печать чека. После того как чек напечатан должно быть возможно вводить новый список товаров.
По правилам оформления документов в каждом чеке вы должны напечатать сначала номер чека (нумерация начинается с единицы) и число товаров, затем список товаров с ценами и в конце — итоговую стоимость. Из-за того, что вы не знаете число товаров, пока кассир не «пробьет» последний товар, нельзя печатать чек по мере ввода товаров. Приходится сначала добавить все необходимые товары и только затем печатать весь чек целиком. В конце чека печатается черта (состоящая из пяти знаков минус), по которой он отрывается от ленты.
Организуйте две функции: add_item(itemName, itemCost) и print_receipt(), которые реализуют указанный функционал. Форматирование сделайте по шаблону в примере.
В случае, когда чек пуст, print_receipt не должна печатать чек. Не забудьте, что после того как чек напечатан, набор выбранных товаров должен обнулиться, чтобы можно было вводить товары для нового чека.
Пример
Ввод	Вывод
add_item('Блокнот', 100)
print_receipt()

add_item('Ручка', 70)
print_receipt()
print_receipt()

add_item('Булочка', 15)
add_item('Булочка', 15)
add_item('Чай', 5)
print_receipt()

add_item('Булочка', 15)
add_item('Булочка', 15)
# (Отменить чек) - этот чек не печатаем	Чек 1. Всего предметов: 1
Блокнот - 100
Итого: 100
-----
Чек 2. Всего предметов: 1
Ручка - 70
Итого: 70
-----
Чек 3. Всего предметов: 3
Булочка - 15
Булочка - 15
Чай - 5
Итого: 35
-----



Задание 4. Айболит

На прием к доктору Айболиту как всегда большая очередь. Так как желающих очень много, то было принято решение в регистратуре открыть еще два окна, при этом написать программу для автоматизации приема больных.
Напишите функцию hello(name), которая принимает на вход имя пациента, приветствует его и сообщает, что его медицинскую карту ищут.
Для поиска медицинской карты напишите функцию search_card(name), которая тоже принимает на вход имя пациента. Эта функция выводит информацию о номере карточки пациента или о том, что она не найдена. Список имён пациентов, пронумерованный с 1, находится в списке base, который является глобальным. Номер пациента соответствует номеру карты.
Пример
Ввод	Вывод
base = ["Иван", "Юлия Иванкова"]

hello("Иван")
search_card("Иван")
hello("Юлия Иванова")
search_card("Юлия Иванова")	Здравствуйте, Иван! Вашу карту ищут...
Ваша карта с номером 1 найдена
Здравствуйте, Юлия Иванова! Вашу карту ищут...
Ваша карта не найдена



'''