'''
Лабораторная работа: Рекурсивные функции

Задание 1.
Трибоначчи
Оказывается, что в дополнение к ряду Фибоначчи существует ещё и ряд Трибоначчи, который начианется с тройки 0, 0, 1, а каждое следующее число равно сумме трёх предыдущих. Числа нумеруются с 0.
Напишите функцию tribonacci(n), которая принимает в себя номер числа и возвращает n-ое число Трибоначчи.
Пример
Ввод	Вывод
print(tribonacci(0))	0
Примечания
Функция должна быть рекурсивной.
'''

def tribonacci(n: int) -> int:
    if n in (0, 1):
        return 0
    
    if n < 4:
        return 1

    return tribonacci(n-1) + tribonacci(n-2) + tribonacci(n-3)



'''
Задание 2.

Сумма элементов списка
Мы уже немного умеем писать рекурсивные программы. Давайте тренироваться дальше.
Напишите рекурсивную функцию rec_linear_sum(some_list), которая вычисляет сумму элементов переданного в неё линейного списка вещественных чисел, 
то есть такого списка, в котором нет вложений.
Пример
Ввод	Вывод
print(rec_linear_sum([]))	0
'''

def linear_sum(some_list: list) -> int | float:
    if not some_list:
        return 0

    return some_list[0] + linear_sum(some_list[1:])
