
'''
Задача 1. Напишите программу, используя  методы append() и extend(), чтобы списки 
list1 = [10, 20, [300, 400, [5000, 6000], 500], 30, 40]  и 
list1 = ['a', 'b', ['c', ['d', 'e', ['f', 'g'], 'k'], 'l'], 'm', 'n']
имели вид:
list1 = [10, 20, [300, 400, [5000, 6000, 7000], 500], 30, 40]
list1 = ['a', 'b', ['c', ['d', 'e', ['f', 'g', 'h', 'i', 'j'], 'k'], 'l'], 'm', 'n']
Подсписок для расширения  sub_list = ['h', 'i', 'j'].
'''

list1 = [10, 20, [300, 400, [5000, 6000], 500], 30, 40]
list2 = ['a', 'b', ['c', ['d', 'e', ['f', 'g'], 'k'], 'l'], 'm', 'n']

list1[2][2].append(7000)
list2[2][1][2].extend(['h', 'i', 'j'])

# print(list1)
# print(list2)




'''
Задача 2. У Олега в банке есть n евро. Он хочет снять всю сумму наличными. 
Номиналы еврокупюр равны 1, 5, 10, 20, 100. Напишите программу которая выводит минимальное 
число купюр должен получить Олег после того, 
как снимет все деньги? На вход программе поступает одно положительные целое число n.
'''

def banknote_counter(n: int) -> int:
    banknotes = [100, 20, 10, 5, 1]
    count = 0
    temp = n

    for i in banknotes:
        count += temp//i    # сколько банкнот номинала i помещается в остатке
        temp %= i    # обновляем остаток суммы

    return count



# print(
#     banknote_counter(1017)    # 14
# )



'''
Задача 3.
В отделе работают 3 сотрудника, которые получают заработную плату в рублях. Требуется определить: 
на сколько зарплата самого высокооплачиваемого из них отличается от самого низкооплачиваемого.
Входные данные
Размеры зарплат всех сотрудников вводятся в одну строку через пробел. 
Каждая заработная плата – это натуральное число, не превышающее 105. И гарантируется ,что все зарплаты различны
Выходные данные
Необходимо вывести одно целое число — разницу между максимальной и минимальной зарплатой.
Примечание: функциями min и max, а также сортировками пользоваться нельзя, мы же условный оператор изучаем)
'''

def max_min_money(money: str) -> int:
    a, b, c = map(int, money.split())
    mx, mn = 0, 0

    # ищем макмимальное число
    if a > b and a > c:
        mx = a
    elif b > c and b > a:
        mx = b
    else:
        mx = c

    # ищем минимальное число
    if a < b and a < c:
        mn = a
    elif b < c and b < a:
        mn = b
    else:
        mn = c

    return mx-mn



# print(
#     max_min_money('1 2 3')    # 2
# )



'''
Задача 4.
Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. 
Счастливым билетом называют такой билет с шестизначным номером (иногда и с незначащими нулями), 
где сумма первых трех цифр равна сумме последних трех. Т.е. 
билеты с номерами 385916 и 2011 – счастливые, т.к. 3+8+5=9+1+6 и 0+0+2=0+1+1. 
Вам требуется написать программу, которая проверяет «счастливость» билета.
Программа получает на вход одно целое число N (0 ≤ N < 106) и должна вывести 
«YES», если билет с номером N счастливый и «NO» в противном случае.
'''

def is_happy_ticket(n: int) -> str:
    temp = str(n)
    temp_len = len(temp)

    if temp_len < 6:
        if temp_len <= 3:
            return 'NO'
        temp = '0'*(6-temp_len) + temp   # если число мешьше 6 символов, добавляем нули

    left_sum = sum(map(int, temp[:3]))
    right_sum = sum(map(int, temp[3:]))

    return 'YES' if left_sum == right_sum else 'NO'



# print(
#     is_happy_ticket(1001)    # YES
# )



'''
Задача 5.
Программа принимает на вход два слова s и t. 
Если слово t является словом s, записанным наоборот, выведите YES, иначе выведите NO.
Слова состоят из маленьких латинских букв. Входные данные не содержат лишних пробелов. 
Слова непустые, и их длины не превосходят 100 символов.
'''

def is_palindrome(s: str, t: str) -> str:
    return 'YES' if s == t[::-1] else 'NO'



# print(
#     is_palindrome('заказ', 'заказ')    # YES
# )



'''
Задача 6.
При игре в «Города» игроки по очереди называют названия городов так, 
чтобы первая буква каждого нового слова совпадала с последней буквой предыдущего. 
При этом считают, что если последняя буква предыдущего слова — мягкий знак, 
то с первой буквой следующего слова надо сравнивать букву, предшествующую мягкому знаку.
Напишите программу, которая считывает подряд две строки, после чего выводит «Good», 
если последний символ первой строки совпадает с первым символом второй (с учётом правила про мягкий знак), и «Bad» 
в противном случае.
'''

def goroda(first: str, second: str) -> str:
    first = first.lower()
    second = second.lower()
    first = first.replace('ь', '')

    try:
        return 'Good' if first[-1] == second[0] else 'Bad'
    except IndexError:
        return 'Bad'



# print(
#     goroda('Москва', 'Архангельск')   # Good
# )



''' 
Задача 7.
Напишите программу, которая имитирует проверку пароля, придуманного пользователем. 
Пользователь сперва вводит пароль, потом вводит подтверждение пароля. Вам нужно обработать следующие ситуации:
если пароль, который ввёл пользователь (в первый раз) короче 7 символов, программа выводит Short
если пароль достаточно длинный, но введённый во второй раз пароль не совпадает с первым, 
программа выводит Difference если же и эта проверка пройдена успешно, программа выводит латинскими буквами OK
'''

def password() -> None:
    while True:
        f_pass = input('Новый пароль (не меньше 7 символов):\n')
        if len(f_pass) < 7:
            print('Short')
            continue

        s_pass = input('Повторите пароль:\n')
        if f_pass != s_pass:
            print('Difference')
        else:
            print('OK')
            return None



# password()



'''
Задача 8.
Программа ваша получает на вход строку - название знака зодиака и затем сообщает 
к какому типу относится введенный знак. Логика определения следующая:
если введут любое из значений Овен, Лев, Стрелец, то программа выводит текст Огненный
если введут любое из значений Телец, Дева, Козерог, то программа выводит текст Земной
если введут любое из значений Близнецы, Весы, Водолей, то программа выводит текст Воздушный
если введут любое из значений Рак, Скорпион, Рыбы, то программа выводит текст Водный
Используйте Оператор switch
'''

def zodiac_sign(zodiac: str) -> str:
    match zodiac.title():
        case 'Овен' | 'Лев' | 'Стрелец':
            print('Огненный')
        case 'Телец' | 'Дева' | 'Козерог':
            print('Земной')
        case 'Близнецы' | 'Весы' | 'Водолей':
            print('Воздушный')
        case 'Рак' | 'Скорпион' | 'Рыбы':
            print('Водный')
        case _:
            print('Нет данных')



# zodiac_sign('рыбы')    # Водный



'''
Задача 9.
На каждой отдельной строчке пользователь вводит друг за другом пароли в виде строки символов. 
Валидными паролями будем считать строки, у которых длина варьируется от 5 до 9 символов включительно. 
Как только вы встретите первый невалидный пароль, ваша программа должна закончить считывать пароли и 
вывести последний введенный валидный пароль.
Гарантируется, что первый пароль всегда валидный
'''

def watch_pass() -> str | None:
    walid_pass = input('Пароль: ')
    
    while True:
        temp_pass = input('\nПароль: ')
        if len(temp_pass) < 5 or len(temp_pass) > 9:
            print(walid_pass)
            break

    return None



# watch_pass()



'''
Задача 10.
У нас в наличии рюкзак, вместимость которого составляет n литров, и наша задача забить его до 
предела максимально возможно. Нам поступают вещи, объем которых измеряется также в литрах, 
и мы должны их складывать в наш рюкзак без возможности пропуска. Как только суммарный объем 
новой добавляемой вещи превысит вместимость рюкзака, ваша программа должна вывести слово "Довольно!" 
и затем на отдельных строчках суммарный объем вещей, которые мы смогли упаковать в рюкзак, и их количество
Входные данные
Число n – вместимость рюкзака. Далее идут произвольное количество строк – объем очередного предмета.
Выходные данные
Строка "Довольно!" и затем два числа – суммарный объем упакованных товаров и их количество. 
Каждое значение выводится в отдельной строке.
'''




'''
Задача 11.
Давайте переберем все числа от а до b включительно и будем их выводить на экран, при этом нужно выполнить следующие условия:
пропускать (не выводить) числа, которые делятся на 2 или на 3
если встречаете число, кратное 777, необходимо принудительно закончить цикл, само это число не выводить
Постарайтесь не использовать цикл for
Формат ввода
Вводится два натуральных числа a и b в отдельных строках. Гарантируется, что a<b.
Формат вывода
Вывести все числа на интервале от a до b включительно согласно условиям в п 1 и 2

Задача 12.
Предположим, вы переписываете у друга рецепты в блокнотик, но вам не нравится "соль". Переписывайте без этого слова.
Формат ввода
На первой строке вводится натуральное число N — количество пунктов рецепта.
Далее следуют N строк — пункты рецепта.
Формат вывода
Одна строка — пункты рецепта, разделённые запятой и пробелом, без пунктов с упоминанием слова "соль" (то есть таких, в которых нет подстроки "соль" в нижнем регистре).

Задача 13.
Напишите программу, которая считывает два натуральных числа a и b (гарантируется, что a<b), после чего для всех чисел от a до b включительно выводит:
“Fizz”, если это число делится на 3;
“Buzz”, если это число делится на 5;
“FizzBuzz”, если выполнены оба предыдущих условия;
само это число в остальных случаях.
Формат ввода
Два числа a и b, каждое на отдельной строке.
Формат вывода
Для всех чисел от a до b напечатайте по одной строке, соответствующей правилам, описанным в условии.

Задача 14.
Напишите программу, которая находит рекордное количество вхождений (не обязательно подряд) символа в строку.
Формат ввода
Вводится одна строка.
Формат вывода
Выводится одно целое число — максимальное количество раз, которое встречается какая-либо буква (без учёта регистра) или иной символ во введённой строке.

Задача 15.
Задана целочисленная квадратная матрица размером N x N. Необходимо обойти элементы этой матрицы сверху вниз слева направо и вывести элементы именно в таком порядке в виде таблицы. 
Программа принимает на вход натуральное число N – количество строк и столбцов матрицы. В каждой из последующих N строк записаны N целых чисел – элементы матрицы. Все числа во входных данных не превышают 100 по абсолютной величине.

Задача 16.
При помощи генератора-списков создайте список, состоящий из слов,  начинающихся с буквы 't' или 'T'. Слова возьмите из переменной phrase, также не забывайте про метод split()
В качестве ответа выведите полученный список, слова в нем должны стоять в том же порядке, в котором они стояли в изначальной фразе
phrase = 'Take only the words that start with t in this sentence'

Задача 17.
Напишите функцию check_password, которая проверяет переданный ей пароль на сложность и печатает на экран результат проверки.
Сложным паролем будет считаться комбинация символов, в которой :
Есть хотя бы 3 цифры
Есть хотя бы одна заглавная буква 
Есть хотя бы один символ из следующего набора "!@#$%*"
Общая длина не менее 10 символов

Задача 18.
Напишите программу, которая отсортирует список subject_marks по возрастанию оценок. Затем распечатайте предметы и оценки, каждую пару на новой строке через пробел. subject_marks = [('English', 88), ('Science', 90), ('Maths', 97), ('Physics', 93),('History', 82)]

Задача 19.
Определите функцию print_to, которая принимает одно натуральное число n и распечатывает на экране последовательность целых чисел от 1 до n включительно. Каждое число необходимо выводить на отдельной строке. 
Ваша задача только написать определение функции print_to Используйте метод рекурсии

Задача 20.
Напишите функцию only_one_positive, которая принимает произвольное количество числовых аргументов и возвращает True, когда из всех переданных значений только одно положительное, в противном случае верните False
Вам необходимо написать только определение функции only_one_positive
Ниже примеры вызова
only_one_positive(1, 2) -> False
only_one_positive(-1, 0, -3, 5, -3) -> True
only_one_positive() -> False
'''